[
  {
    "judul": "Top-Up Game Mudah di {namaWeb} | Nikmati pengalaman Gaming Tanpa Batas",
    "deskripsi": "Bermain game online telah menjadi aktivitas hiburan yang sangat populer bagi para penggemarnya. Namun, untuk dapat menikmati pengalaman bermain yang nyaman dan bebas drama, seringkali kita perlu melakukan top-up saldo pada platform yang terpercaya. Salah satu platform yang menyediakan layanan top-up dengan mudah dan aman adalah {namaWeb}.",
    "publikasi": "14 Mei 2025",
    "gambar": "/data/list-game/mobile-legend.png"
  },
  {
    "judul": "M6 World Championship 2024: Swiss Stage Overview and Key Matches",
    "deskripsi": "M6 World Championship adalah puncak dari kompetisi Mobile Legends: Bang Bang, menghadirkan tim-tim terbaik dunia untuk memperebutkan gelar juara. Tahun ini, persaingan semakin sengit dengan diperkenalkannya format baru Swiss Stage yang memberikan sentuhan menarik pada turnamen ini.",
    "publikasi": "19 November 2024",
    "gambar": "/data/list-game/brawl-stars.jpg"
  },
  {
    "judul": "5 Game Terbaru yang Wajib Kamu Mainkan di Bulan Ini",
    "deskripsi": "Industri game terus berkembang dengan cepat, menghadirkan game-game baru yang menawarkan pengalaman unik. Jika kamu penggemar game yang terus mencari pengalaman baru, berikut adalah 5 game terbaru bulan ini yang wajib kamu mainkan. Dari eksplorasi luar angkasa hingga horor yang menegangkan, setiap game menawarkan fitur dan gameplay yang tak bisa dilewatkan. Pastikan kamu melakukan top-up game di Digigame.id untuk menikmati konten eksklusif dan item tambahan yang memperkaya pengalaman bermain.",
    "publikasi": "9 October 2024",
    "gambar": "/data/list-game/coc.png"
  },
  {
    "judul": "6 Game MOBA Terbaik ",
    "deskripsi": "Rekomendasi 6 Game MOBA Terbaik untuk HP Android yang bisa kamu mainkan bersama teman terdekat. salah satu genre game favorit yang sudah ada sejak dahulu adalah MOBA atau multiplayer online battle arena. Sebuah game multiplayer online yang biasanya butuh banyak player yang biasanya membentuk tim 5 lawan 5  atau sejenisnya. Game dengan genre MOBA ini sebenarnya sudah ada sejak zaman PC desktop yang kini mulai menyebar ke pengguna Android.",
    "publikasi": "19 November 2025",
    "gambar": "/data/list-game/free-fire.png"
  }
]
