[
  {
    "id": "mobile-legends-update-juni-2025-hero-baru-dan-revamp-sistem-ranked",
    "konten": [
      {
        "type": "image",
        "url": "/assets/images/list-game/mobile-legend.png",
        "caption": "Mobile Legends Update Juni 2025"
      },
      {
        "type": "pblk",
        "publikasi": "2025-06-01"
      },
      {
        "type": "pnls",
        "penulis": "Manusia Setengah Harimau"
      },
      {
        "type": "heading2",
        "text": "Mobile Legends Update Juni 2025: Hero Baru dan Revamp Sistem Ranked"
      },
      {
        "type": "paragraph",
        "text": "Moonton resmi mengumumkan update masif Mobile Legends: Bang Bang untuk bulan Juni 2025. Update ini menghadirkan 3 hero baru sekaligus, revamp total sistem ranked, dan mode battle royale yang sudah lama ditunggu-tunggu para pemain."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/mobile-legend.png",
        "caption": "Tiga hero baru: Zephyr, Luna, dan Vortex"
      },
      {
        "type": "heading3",
        "text": "Hero Baru: Zephyr the Wind Assassin"
      },
      {
        "type": "paragraph",
        "text": "Zephyr adalah assassin dengan kemampuan mobilitas tinggi yang dapat 'berjalan di udara' selama 5 detik. Skill combo-nya sangat mematikan untuk burst damage, namun memiliki cooldown yang cukup panjang sehingga timing menjadi kunci utama."
      },
      {
        "type": "list",
        "text": [
          "Skill 1: Wind Slash - Dash cepat dengan damage 450 (+120% Physical Attack)",
          "Skill 2: Aerial Step - Dapat berjalan di udara dan melewati obstacle selama 5 detik",
          "Ultimate: Tornado Strike - AOE damage masif dengan knockup effect",
          "Passive: Wind Walker - Movement speed +30% setelah menggunakan skill"
        ]
      },
      {
        "type": "heading3",
        "text": "Luna the Celestial Mage"
      },
      {
        "type": "paragraph",
        "text": "Luna adalah mage dengan konsep day/night cycle yang unik. Skill-nya berubah tergantung waktu dalam game, memberikan versatility yang belum pernah ada sebelumnya dalam Mobile Legends."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/mobile-legend.png",
        "caption": "Luna dengan mode Day dan Night"
      },
      {
        "type": "list",
        "text": [
          "Day Mode: Skill memberikan heal dan shield kepada ally",
          "Night Mode: Skill berubah menjadi damage dan crowd control",
          "Skill dapat di-toggle manual dengan cooldown 8 detik",
          "Ultimate berbeda total antara day dan night mode"
        ]
      },
      {
        "type": "heading3",
        "text": "Vortex the Tank Disruptor"
      },
      {
        "type": "paragraph",
        "text": "Vortex adalah tank dengan kemampuan space manipulation. Dia dapat mengubah positioning battlefield dan memaksa enemy untuk bergerak sesuai keinginannya."
      },
      {
        "type": "list",
        "text": [
          "Skill 1: Gravity Pull - Menarik semua enemy dalam radius 6 yard",
          "Skill 2: Space Swap - Menukar posisi dengan ally atau enemy",
          "Ultimate: Dimensional Rift - Menciptakan portal yang menghubungkan dua area",
          "Passive: Void Shield - Absorb 15% damage yang diterima ally terdekat"
        ]
      },
      {
        "type": "heading3",
        "text": "Revamp Sistem Ranked: Seasonal Mastery"
      },
      {
        "type": "paragraph",
        "text": "Sistem ranked baru memperkenalkan 'Seasonal Mastery' dimana pemain tidak hanya dinilai dari win rate, tetapi juga performa individual dengan hero spesifik. Setiap season berlangsung 2 bulan dengan tema dan meta yang berbeda."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/mobile-legend.png",
        "caption": "Interface sistem ranked yang baru"
      },
      {
        "type": "list",
        "text": [
          "Rank Tiers: Bronze, Silver, Gold, Platinum, Diamond, Mythic, Mythical Glory",
          "Sub-divisions: Setiap tier memiliki 5 divisi (I, II, III, IV, V)",
          "Protection System: Pemain tidak bisa turun tier dalam 7 hari pertama",
          "Bonus Star: Didapat dari MVP, double/triple kill, dan objective contribution",
          "Season Rewards: Skin eksklusif, recall effect, dan border frame"
        ]
      },
      {
        "type": "heading3",
        "text": "Mode Battle Royale: Survival Island"
      },
      {
        "type": "paragraph",
        "text": "Mode yang paling ditunggu akhirnya tiba! Survival Island menghadirkan 100 pemain dalam satu map besar dengan sistem looting dan safe zone seperti game BR pada umumnya, namun dengan twist MOBA mechanics."
      },
      {
        "type": "list",
        "text": [
          "100 players start, solo/duo/squad mode available",
          "Pick hero at start, dapat upgrade dengan item yang ditemukan",
          "Map size: 4x lebih besar dari map classic",
          "Duration: 20-25 menit per match",
          "Special items: Equipment yang memberikan skill tambahan"
        ]
      }
    ]
  },
  {
    "id": "genshin-impact-fontaine-expansion-complete-guide-2025",
    "konten": [
      {
        "type": "image",
        "url": "/assets/images/list-game/genshin.jpg",
        "caption": "Genshin Impact Fontaine Expansion Complete"
      },
      {
        "type": "pblk",
        "publikasi": "2025-05-28"
      },
      {
        "type": "pnls",
        "penulis": "Manusia Setengah Harimau"
      },
      {
        "type": "heading2",
        "text": "Genshin Impact Fontaine Expansion Complete Guide 2025"
      },
      {
        "type": "paragraph",
        "text": "HoYoverse telah merilis expansion terakhir untuk region Fontaine dengan menambahkan 3 area baru, 4 karakter 5-star, dan sistem Justice Court yang revolusioner. Expansion ini menutup arc Fontaine dengan epic storyline yang melibatkan semua Archon."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/genshin.jpg",
        "caption": "Tiga area baru: Aquatic Gardens, Crystal Caverns, dan Sky Palace"
      },
      {
        "type": "heading3",
        "text": "Karakter Baru: Furina - Hydro Archon"
      },
      {
        "type": "paragraph",
        "text": "Furina sebagai Hydro Archon memiliki kit yang sangat unik dengan kemampuan mengontrol elemen air dalam bentuk yang belum pernah ada. Dia dapat menciptakan 'Water Stage' yang mengubah battlefield menjadi area performancenya."
      },
      {
        "type": "list",
        "text": [
          "Element: Hydro",
          "Weapon: Sword",
          "Role: Sub-DPS/Support hybrid",
          "Constellation effect: Meningkatkan party-wide elemental mastery",
          "Signature weapon: Song of Eternal Waters (5-star sword)"
        ]
      },
      {
        "type": "heading3",
        "text": "Neuvillette - Chief Justice of Fontaine"
      },
      {
        "type": "paragraph",
        "text": "Neuvillette adalah DPS Hydro dengan range attack terpanjang dalam game. Charged attack-nya dapat mencapai hampir seluruh layar dan memiliki penetration effect yang menembus semua enemy."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/genshin.jpg",
        "caption": "Neuvillette demonstrasi charged attack"
      },
      {
        "type": "list",
        "text": [
          "Charged Attack: Torrent of Justice - Long range penetrating water beam",
          "Elemental Skill: Judgment Protocol - Marks enemies for increased damage",
          "Elemental Burst: Sovereign's Verdict - Massive AOE hydro damage",
          "Passive: Dragon Authority - Gains damage bonus based on current HP percentage"
        ]
      },
      {
        "type": "heading3",
        "text": "Lynette & Lyney - Twin Magicians"
      },
      {
        "type": "paragraph",
        "text": "Duo karakter yang dapat dimainkan bersamaan dalam satu team dengan special synergy. Lynette sebagai Anemo support dan Lyney sebagai Pyro DPS memiliki combo attack eksklusif ketika keduanya ada di party."
      },
      {
        "type": "list",
        "text": [
          "Lynette: Anemo Sword user dengan stealth mechanics",
          "Lyney: Pyro Bow user dengan trick shot abilities",
          "Twin Resonance: Bonus damage ketika keduanya di party",
          "Special combo: Magic Finale - Joint elemental burst"
        ]
      },
      {
        "type": "heading3",
        "text": "Justice Court System"
      },
      {
        "type": "paragraph",
        "text": "Fitur gameplay baru dimana pemain dapat berpartisipasi dalam court trials sebagai detective, lawyer, atau judge. Setiap keputusan mempengaruhi story progression dan rewards yang didapat."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/genshin.jpg",
        "caption": "Interface Justice Court System"
      },
      {
        "type": "list",
        "text": [
          "3 Role berbeda: Detective (investigate), Lawyer (defend/prosecute), Judge (decide)",
          "Case difficulty: Easy, Normal, Hard, Legendary",
          "Rewards: Primogems, exclusive weapons, character materials",
          "Weekly challenges dengan rotating cases",
          "Multiplayer mode: Co-op investigation dengan friends"
        ]
      },
      {
        "type": "heading3",
        "text": "New Artifacts & Weapons"
      },
      {
        "type": "paragraph",
        "text": "Expansion ini memperkenalkan 3 artifact set baru yang dirancang khusus untuk karakter Fontaine, plus 8 weapon baru termasuk 2 signature weapon untuk Archon."
      },
      {
        "type": "list",
        "text": [
          "Performer's Stage (Hydro damage +15%, skill damage +25%)",
          "Judge's Wisdom (Elemental mastery +80, reaction damage +40%)",
          "Twin Resonance (Party synergy bonus, switching character reduces cooldown)",
          "New 5-star weapons: Song of Eternal Waters, Scale of Justice",
          "New 4-star weapons: Magician's Wand, Investigator's Lens, Court Sword"
        ]
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/genshin.jpg",
        "caption": "Preview artifact sets dan weapons baru"
      }
    ]
  },
  {
    "id": "call-of-duty-mobile-season-6-2025-battle-royale-overhaul",
    "konten": [
      {
        "type": "image",
        "url": "/assets/images/list-game/call-of-duty.jpeg",
        "caption": "Call of Duty Mobile Season 6: Tactical Warfare"
      },
      {
        "type": "pblk",
        "publikasi": "2025-05-25"
      },
      {
        "type": "pnls",
        "penulis": "Manusia Setengah Harimau"
      },
      {
        "type": "heading2",
        "text": "Call of Duty Mobile Season 6 2025: Battle Royale Overhaul dan Mode Tactical"
      },
      {
        "type": "paragraph",
        "text": "Activision menghadirkan season terbesar dalam sejarah Call of Duty Mobile dengan complete overhaul pada Battle Royale mode, penambahan Tactical Warfare mode 10v10, dan introduction sistem Squad Specialization yang mengubah cara team bekerja sama."
      },
      {
        "type": "heading3",
        "text": "Battle Royale 2.0: Blackout Remastered"
      },
      {
        "type": "paragraph",
        "text": "Map Blackout yang iconic dari Call of Duty: Black Ops 4 kini hadir di mobile dengan visual yang di-enhance dan gameplay mechanics yang disesuaikan untuk touchscreen. Map ini 40% lebih besar dari Isolated dengan area-area baru yang belum pernah ada."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/call-of-duty.jpeg",
        "caption": "Blackout map dengan area-area baru"
      },
      {
        "type": "list",
        "text": [
          "Map size: 8km x 8km (40% lebih besar dari Isolated)",
          "New POI: Nuketown, Firing Range, Sanitarium, Lighthouse",
          "Dynamic weather: Rain, fog, sandstorm mempengaruhi visibility",
          "Vehicle upgrades: Armor plating dan weapon mounting",
          "Zombie areas: Special zones dengan PvE elements"
        ]
      },
      {
        "type": "heading3",
        "text": "Squad Specialization System"
      },
      {
        "type": "paragraph",
        "text": "Setiap anggota squad kini dapat memilih specialization role yang memberikan unique abilities dan equipment. Ini mendorong teamwork yang lebih strategic dan mengurangi solo play dalam team modes."
      },
      {
        "type": "list",
        "text": [
          "Assault: Extra damage, faster reload, breach charges",
          "Support: Healing items, ammo resupply, UAV booster",
          "Recon: Extended minimap, heartbeat sensor, thermal scope",
          "Engineer: Vehicle repair, trap detector, EMP grenades",
          "Medic: Revive speed +50%, healing aura, stim shots"
        ]
      },
      {
        "type": "heading3",
        "text": "Tactical Warfare: 10v10 Large Scale Combat"
      },
      {
        "type": "paragraph",
        "text": "Mode baru yang menghadirkan pertempuran large-scale dengan objective-based gameplay. Maps dirancang khusus untuk 20 pemain dengan multiple objective yang harus dikuasai secara bersamaan."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/call-of-duty.jpeg",
        "caption": "Tactical Warfare 10v10 gameplay"
      },
      {
        "type": "list",
        "text": [
          "Match duration: 15-20 menit",
          "3 maps khusus: Urban District, Desert Compound, Harbor Defense",
          "Multiple objectives: Capture points, payload escort, VIP protection",
          "Scorestreak sharing: Tim dapat contribute untuk major scorestreaks",
          "Dynamic spawns: Spawn points berubah based on objective control"
        ]
      },
      {
        "type": "heading3",
        "text": "New Weapons & Attachments"
      },
      {
        "type": "paragraph",
        "text": "Season 6 menghadirkan 6 senjata baru dari berbagai kategori, plus sistem attachment yang di-expand dengan 15 attachment baru yang mengubah weapon behavior secara signifikan."
      },
      {
        "type": "list",
        "text": [
          "Primary: XM4 Assault Rifle, Mac-10 SMG, Pelington 703 Sniper",
          "Secondary: Diamatti Pistol, Cigma 2 RPG, Sledgehammer Melee",
          "New attachments: Dragon's Breath Rounds, Subsonic Ammo, Thermal Scope",
          "Gunsmith 2.0: 10 attachment slots (naik dari 5)",
          "Weapon mastery: Unlock special camos dan variants"
        ]
      },
      {
        "type": "heading3",
        "text": "Ranked Series Reformation"
      },
      {
        "type": "paragraph",
        "text": "Sistem ranked mengalami overhaul total dengan introduction skill-based matchmaking yang lebih akurat, seasonal rewards yang lebih menarik, dan competitive integrity yang ditingkatkan."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/call-of-duty.jpeg",
        "caption": "Interface ranked series yang baru"
      },
      {
        "type": "list",
        "text": [
          "New tiers: Rookie, Veteran, Elite, Pro, Master, Grandmaster, Legendary",
          "Skill-based matchmaking: Mempertimbangkan K/D, objective play, team contribution",
          "Season duration: 2 bulan dengan monthly mini-seasons",
          "Rewards: Exclusive weapon skins, calling cards, frames",
          "Leaderboard regional dan global dengan monthly tournaments"
        ]
      },
      {
        "type": "heading3",
        "text": "Quality of Life Updates"
      },
      {
        "type": "paragraph",
        "text": "Berbagai improvements untuk meningkatkan user experience, termasuk optimization untuk device low-end, UI refresh, dan social features yang diperluas."
      },
      {
        "type": "list",
        "text": [
          "Performance optimization: Frame rate lebih stabil di semua device",
          "UI overhaul: Interface lebih clean dan intuitive",
          "Clan system expansion: Clan wars, tournaments, shared rewards",
          "Training ground upgrade: AI behavior lebih realistic",
          "Spectator mode: Watch friends dan pro players live"
        ]
      }
    ]
  },
  {
    "id": "free-fire-max-project-dawn-update-2025-character-evolution",
    "konten": [
      {
        "type": "image",
        "url": "/assets/images/list-game/free-fire.png",
        "caption": "Free Fire MAX: Project Dawn - The Evolution Begins"
      },
      {
        "type": "pblk",
        "publikasi": "2025-05-22"
      },
      {
        "type": "pnls",
        "penulis": "Manusia Setengah Harimau"
      },
      {
        "type": "heading2",
        "text": "Free Fire MAX Project Dawn: Character Evolution dan Map Reconstruction 2025"
      },
      {
        "type": "paragraph",
        "text": "Garena Free Fire MAX menghadirkan update terbesar sepanjang masa dengan Project Dawn yang memperkenalkan Character Evolution system, complete map overhaul, dan revolutionary AI companion feature yang mengubah cara pemain bermain battle royale."
      },
      {
        "type": "heading3",
        "text": "Character Evolution: Beyond Awakening"
      },
      {
        "type": "paragraph",
        "text": "Sistem evolusi karakter yang memungkinkan setiap character berkembang melampaui level maksimal saat ini. Character dapat berevolusi hingga 5 tahap dengan appearance dan abilities yang berubah drastis."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/free-fire.png",
        "caption": "5 tahap evolusi karakter dari basic hingga legendary"
      },
      {
        "type": "list",
        "text": [
          "Stage 1-2: Stat enhancement dan visual upgrade minor",
          "Stage 3: New passive ability unlock",
          "Stage 4: Enhanced active skill dengan cooldown reduction",
          "Stage 5: Ultimate form dengan exclusive cosmetic dan signature skill",
          "Evolution materials: Didapat dari ranked matches dan special events"
        ]
      },
      {
        "type": "heading3",
        "text": "Featured Character Evolutions"
      },
      {
        "type": "paragraph",
        "text": "Beberapa character mendapat spotlight khusus dalam update ini dengan evolution tree yang sangat impressive dan gameplay-changing abilities."
      },
      {
        "type": "list",
        "text": [
          "DJ Alok Evolution: Music area effect expanded, healing overtime ditambah movement speed boost",
          "Chrono Evolution: Time field dapat digunakan untuk freeze projectiles in mid-air",
          "K Evolution: Master form memberikan damage immunity selama 2 detik setiap 15 detik",
          "Hayato Evolution: Sword slash dapat menembus cover dan memberikan bleeding effect",
          "Maxim Evolution: Eating speed boost berlaku untuk semua consumables termasuk medical items"
        ]
      },
      {
        "type": "heading3",
        "text": "Map Reconstruction: Bermuda Reborn"
      },
      {
        "type": "paragraph",
        "text": "Map Bermuda mengalami reconstruction total dengan theme futuristic-apocalyptic. 70% area di-redesign dengan menambahkan vertical gameplay elements dan interactive environments."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/free-fire.png",
        "caption": "Aerial view Bermuda Reborn dengan struktur vertikal"
      },
      {
        "type": "list",
        "text": [
          "Vertical zones: Multi-level buildings hingga 8 lantai",
          "Interactive elements: Destructible walls, moving platforms, zip-line networks",
          "New POI: Neo Tokyo District, Crystal Mines, Sky Gardens, Underground Labs",
          "Dynamic events: Area random events seperti meteor shower, acid rain",
          "Safe zone variations: Circle patterns yang tidak predictable"
        ]
      },
      {
        "type": "heading3",
        "text": "AI Companion System: ARIA"
      },
      {
        "type": "paragraph",
        "text": "Revolutionary AI companion bernama ARIA yang dapat membantu players dalam berbagai aspek gameplay. ARIA dapat di-customize dan develop seiring waktu bermain."
      },
      {
        "type": "list",
        "text": [
          "Combat assistance: Callout enemy positions, suggest tactical movements",
          "Resource management: Optimize inventory, suggest item combinations",
          "Learning capability: Adapts to player's playstyle over time",
          "Voice interaction: Respond to voice commands (English, Indonesian, dll)",
          "Customization: Different AI personalities dan visual representations"
        ]
      },
      {
        "type": "heading3",
        "text": "New Weapons & Vehicles"
      },
      {
        "type": "paragraph",
        "text": "Project Dawn memperkenalkan 8 weapons baru dengan unique mechanics dan 4 vehicles baru yang dirancang khusus untuk vertical gameplay di map yang telah direkonstruksi."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/free-fire.png",
        "caption": "Preview weapons dan vehicles Project Dawn"
      },
      {
        "type": "list",
        "text": [
          "Plasma Rifle: Energy weapon dengan penetration capabilities",
          "Gravity Hammer: Melee weapon yang menciptakan shockwave AOE",
          "Quantum Bow: Arrows dapat teleport through walls",
          "Hover Bike: Flying vehicle untuk vertical movement",
          "Battle Mech: 2-person vehicle dengan mounted weapons",
          "All weapons: Attachment system expanded dengan futuristic mods"
        ]
      },
      {
        "type": "heading3",
        "text": "Competitive Scene Evolution"
      },
      {
        "type": "paragraph",
        "text": "Free Fire Pro League mendapat format baru dengan introduction team-based character evolution dan seasonal meta shifts yang membuat competitive scene lebih dynamic."
      },
      {
        "type": "list",
        "text": [
          "Team Evolution Pool: Shared evolution progress dalam tournament teams",
          "Seasonal meta: Different character evolution combinations per season",
          "Draft system: Teams dapat ban certain character evolutions",
          "Prize pool: $5 million untuk Free Fire World Championship 2025",
          "Regional qualifiers: 32 regions compete untuk 16 final slots"
        ]
      },
      {
        "type": "heading3",
        "text": "Social & Guild Features"
      },
      {
        "type": "paragraph",
        "text": "Expansion massive pada social features dengan guild system yang lebih complex, mentorship program, dan community-driven content creation tools."
      },
      {
        "type": "list",
        "text": [
          "Guild Evolution: Guilds dapat level up dan unlock group benefits",
          "Mentorship: Veteran players dapat mentor newcomers dengan reward system",
          "Content creator tools: In-game video editing dan sharing capabilities",
          "Cross-server play: Guild members dari different servers dapat play together",
          "Community events: User-generated tournaments dan challenges"
        ]
      }
    ]
  },
  {
    "id": "pubg-mobile-metro-royale-chapter-4-underground-expansion",
    "konten": [
      {
        "type": "image",
        "url": "/assets/images/list-game/pubg.jpg",
        "caption": "PUBG Mobile Metro Royale Chapter 4: Underground Expansion"
      },
      {
        "type": "pblk",
        "publikasi": "2025-05-20"
      },
      {
        "type": "pnls",
        "penulis": "Manusia Setengah Harimau"
      },
      {
        "type": "heading2",
        "text": "PUBG Mobile Metro Royale Chapter 4: Underground Expansion dan Faction Wars"
      },
      {
        "type": "paragraph",
        "text": "Tencent Games mengumumkan Chapter 4 dari mode Metro Royale yang paling popular dengan menambahkan massive underground network, faction-based warfare system, dan persistent world elements yang membuat setiap session mempengaruhi session berikutnya."
      },
      {
        "type": "heading3",
        "text": "Underground Network: The Deep Metro"
      },
      {
        "type": "paragraph",
        "text": "Ekspansi besar-besaran ke arah bawah tanah dengan network tunnel yang menghubungkan semua major stations. Underground area ini memiliki ecosystem sendiri dengan unique enemies, resources, dan environmental hazards."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/pubg.jpg",
        "caption": "Deep Metro tunnel network dengan lighting atmospheric"
      },
      {
        "type": "list",
        "text": [
          "5 underground levels dengan increasing difficulty",
          "Tunnel network: 15km total length menghubungkan 12 stations",
          "Environmental hazards: Radioactive zones, flooding areas, gas leaks",
          "Underground bosses: Mutant creatures dengan unique loot drops",
          "Mining system: Extract rare materials untuk weapon crafting"
        ]
      },
      {
        "type": "heading3",
        "text": "Faction Wars: Three-Way Conflict"
      },
      {
        "type": "paragraph",
        "text": "Players kini dapat bergabung dengan salah satu dari tiga faction yang sedang berperang memperebutkan kontrol Metro. Setiap faction memiliki philosophy, equipment, dan objectives yang berbeda."
      },
      {
        "type": "list",
        "text": [
          "The Order: Military faction dengan advanced weapons dan vehicles",
          "The Stalkers: Scavenger faction dengan stealth capabilities dan knowledge",
          "The Mutants: Hybrid faction dengan biological enhancements",
          "Faction benefits: Exclusive weapons, skills, safe houses",
          "Weekly faction wars: Large scale battles untuk territory control"
        ]
      },
      {
        "type": "heading3",
        "text": "Persistent World Elements"
      },
      {
        "type": "paragraph",
        "text": "Metro Royale kini memiliki persistent elements dimana actions di previous sessions mempengaruhi world state. Structures dapat dibangun, resources dapat depleted, dan faction control dapat berubah."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/pubg.jpg",
        "caption": "Before/after comparison dari player-built structures"
      },
      {
        "type": "list",
        "text": [
          "Base building: Construct safe houses dan resource facilities",
          "Resource depletion: Over-harvesting affects availability untuk semua players",
          "Territory control: Faction dominance mempengaruhi spawn rates dan enemy behavior",
          "Community projects: Players dapat collaborate untuk major constructions",
          "Seasonal resets: World state reset setiap 3 bulan dengan new objectives"
        ]
      },
      {
        "type": "heading3",
        "text": "Enhanced Survival Mechanics"
      },
      {
        "type": "paragraph",
        "text": "Survival aspects di-deepen dengan introduction stamina system, temperature management, dan psychological health yang mempengaruhi character performance."
      },
      {
        "type": "list",
        "text": [
          "Stamina system: Running, climbing, fighting menguras stamina",
          "Temperature: Cold/hot areas mempengaruhi health regeneration",
          "Hunger/thirst: Must maintain food dan water levels",
          "Psychological stress: Prolonged combat atau isolation affects accuracy",
          "Sleep system: Rest untuk restore stamina dan mental health"
        ]
      },
      {
        "type": "heading3",
        "text": "Weapon Crafting & Modification"
      },
      {
        "type": "paragraph",
        "text": "Advanced crafting system yang memungkinkan players membuat custom weapons dari scavenged parts. Setiap crafted weapon memiliki unique stats tergantung materials dan crafting skill."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/pubg.jpg",
        "caption": "Weapon crafting interface dengan material requirements"
      },
      {
        "type": "list",
        "text": [
          "Material types: Metal scraps, electronics, chemical compounds, rare gems",
          "Crafting stations: Different stations untuk different weapon types",
          "Quality levels: Poor, Common, Rare, Epic, Legendary crafted weapons",
          "Modification slots: 8 modification points per weapon",
          "Durability system: Weapons degrade dengan usage dan need maintenance"
        ]
      },
      {
        "type": "heading3",
        "text": "New Mutant Creatures & AI Enemies"
      },
      {
        "type": "paragraph",
        "text": "Chapter 4 memperkenalkan 12 jenis mutant creatures baru dengan AI behavior yang sophisticated. Mereka tidak hanya aggressive tapi juga dapat cooperate dan set ambushes."
      },
      {
        "type": "list",
        "text": [
          "Shadow Stalkers: Invisible enemies yang attack dari behind",
          "Pack Hunters: Coordinate attacks dalam groups of 5-8",
          "Tunnel Dwellers: Large creatures yang guard underground passages",
          "Psy-Mutants: Dapat disable player abilities temporarily",
          "Swarm Queens: Spawn smaller creatures untuk overwhelm players"
        ]
      },
      {
        "type": "heading3",
        "text": "Trading & Economy System"
      },
      {
        "type": "paragraph",
        "text": "Introduction player-to-player trading system dengan in-game economy yang dynamic. Prices fluctuate based on supply/demand dan faction control over resource areas."
      },
      {
        "type": "list",
        "text": [
          "Trading posts: Safe zones untuk player-to-player transactions",
          "Auction house: Bid system untuk rare items",
          "Currency types: Metro Coins, Faction Tokens, Barter Goods",
          "Price fluctuation: Supply/demand affects item values weekly",
          "Black market: Higher risk trading dengan better rewards"
        ]
      }
    ]
  },
  {
    "id": "valorant-mobile-episode-7-agents-unleashed-tactical-evolution",
    "konten": [
      {
        "type": "image",
        "url": "/assets/images/list-game/valorant.jpg",
        "caption": "VALORANT Mobile Episode 7: Agents Unleashed"
      },
      {
        "type": "pblk",
        "publikasi": "2025-05-18"
      },
      {
        "type": "pnls",
        "penulis": "Manusia Setengah Harimau"
      },
      {
        "type": "heading2",
        "text": "VALORANT Mobile Episode 7: Agents Unleashed dan Tactical Evolution System"
      },
      {
        "type": "paragraph",
        "text": "Riot Games menghadirkan episode terbesar VALORANT Mobile dengan introduction 4 agents baru sekaligus, revolutionary Tactical Evolution system yang memungkinkan customization abilities, dan competitive scene yang integrated dengan PC version."
      },
      {
        "type": "heading3",
        "text": "New Agents: The Elemental Four"
      },
      {
        "type": "paragraph",
        "text": "Episode 7 memperkenalkan 4 agents dengan theme elemental powers yang belum pernah ada dalam VALORANT universe. Setiap agent memiliki connection ke natural elements dan unique interaction dengan map environments."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/valorant.jpg",
        "caption": "The Elemental Four: Zephyr, Terra, Blaze, dan Hydro"
      },
      {
        "type": "list",
        "text": [
          "Zephyr (Initiator): Wind-based abilities untuk information gathering dan enemy displacement",
          "Terra (Sentinel): Earth manipulation untuk defensive structures dan area denial",
          "Blaze (Duelist): Fire abilities dengan damage over time dan vision obscuring",
          "Hydro (Controller): Water/ice abilities untuk area control dan team utility"
        ]
      },
      {
        "type": "heading3",
        "text": "Zephyr - Master of Wind"
      },
      {
        "type": "paragraph",
        "text": "Zephyr adalah initiator dengan kemampuan wind manipulation yang dapat gather information dan create opportunities untuk team. Abilities-nya synergize dengan vertical gameplay elements."
      },
      {
        "type": "list",
        "text": [
          "Signature Ability: Wind Pulse - Detect enemies through walls dalam radius besar",
          "Basic Ability 1: Gust - Push back enemies atau boost ally movement speed",
          "Basic Ability 2: Updraft - Create air currents untuk enhanced mobility",
          "Ultimate: Hurricane - Large AOE yang slows enemies dan reveals positions"
        ]
      },
      {
        "type": "heading3",
        "text": "Terra - Earth Guardian"
      },
      {
        "type": "paragraph",
        "text": "Terra sebagai sentinel dapat create defensive structures dan control map geometry. Perfect untuk anchoring sites dan creating tactical advantages melalui terrain modification."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/valorant.jpg",
        "caption": "Terra creating defensive structures"
      },
      {
        "type": "list",
        "text": [
          "Signature Ability: Stone Wall - Create destructible cover dengan varying heights",
          "Basic Ability 1: Tremor - Ground slam yang slows enemies dalam area",
          "Basic Ability 2: Pebble Shot - Tracking projectile yang marks enemies",
          "Ultimate: Earthquake - Massive area disruption yang damages dan disorients"
        ]
      },
      {
        "type": "heading3",
        "text": "Tactical Evolution System"
      },
      {
        "type": "paragraph",
        "text": "Revolutionary system yang memungkinkan players untuk customize agent abilities dengan evolution trees. Setiap agent dapat develop dalam 3 different paths tergantung playstyle preference."
      },
      {
        "type": "list",
        "text": [
          "3 Evolution paths per agent: Aggressive, Support, Utility",
          "Evolution points: Earned through competitive performance",
          "Ability modifications: Change duration, damage, area of effect",
          "New interactions: Evolved abilities dapat combine untuk unique effects",
          "Seasonal resets: Evolution trees dapat di-respec setiap episode"
        ]
      },
      {
        "type": "heading3",
        "text": "Cross-Platform Integration"
      },
      {
        "type": "paragraph",
        "text": "VALORANT Mobile kini fully integrated dengan PC version dalam competitive scene. Mobile players dapat compete dalam same tournaments dan share progression system."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/valorant.jpg",
        "caption": "Cross-platform tournament interface"
      },
      {
        "type": "list",
        "text": [
          "Unified ranking: Same competitive tiers antara mobile dan PC",
          "Cross-platform parties: Mobile dan PC players dapat team up",
          "Shared battle pass: Progress sync across all platforms",
          "Tournament eligibility: Mobile players dapat qualify untuk VCT events",
          "Performance parity: Mobile-specific optimizations untuk fair competition"
        ]
      },
      {
        "type": "heading3",
        "text": "New Maps: Elemental Battlegrounds"
      },
      {
        "type": "paragraph",
        "text": "3 maps baru yang dirancang specifically untuk showcase elemental agents abilities dengan interactive environmental elements yang dapat dimanipulasi."
      },
      {
        "type": "list",
        "text": [
          "Tempest Peak: Wind-based map dengan moving platforms dan air currents",
          "Crystal Caverns: Earth-themed dengan destructible walls dan underground passages",
          "Volcanic Forge: Fire/lava elements dengan temperature-based mechanics"
        ]
      },
      {
        "type": "heading3",
        "text": "Enhanced Mobile Features"
      },
      {
        "type": "paragraph",
        "text": "Mobile-specific features yang take advantage dari touchscreen capabilities dan mobile gaming habits, termasuk gesture controls dan social features."
      },
      {
        "type": "list",
        "text": [
          "Gesture casting: Use finger gestures untuk quick ability activation",
          "Voice command integration: Call out strategies dengan voice recognition",
          "Mobile-optimized UI: Customizable HUD layouts untuk different screen sizes",
          "Quick match: Shorter game modes untuk mobile gaming sessions",
          "Social hub: In-game social space untuk meeting teammates"
        ]
      },
      {
        "type": "heading3",
        "text": "Competitive Season Structure"
      },
      {
        "type": "paragraph",
        "text": "New competitive structure yang designed untuk mobile gaming dengan shorter seasons tapi more frequent updates dan events."
      },
      {
        "type": "list",
        "text": [
          "Acts duration: 6 weeks instead of 8-10 weeks",
          "Weekly tournaments: Regular community competitions",
          "Mobile-specific leagues: Dedicated competitive circuits",
          "Seasonal rewards: Exclusive skins dan cosmetics untuk mobile players",
          "Progression bonuses: Extra XP untuk mobile-specific achievements"
        ]
      }
    ]
  },
  {
    "id": "clash-royale-arena-evolution-2025-tower-customization-system",
    "konten": [
      {
        "type": "image",
        "url": "/assets/images/list-game/clash-royale.jpg",
        "caption": "Clash Royale Arena Evolution: The Ultimate Tower Defense Experience"
      },
      {
        "type": "pblk",
        "publikasi": "2025-05-15"
      },
      {
        "type": "pnls",
        "penulis": "Manusia Setengah Harimau"
      },
      {
        "type": "heading2",
        "text": "Clash Royale Arena Evolution 2025: Tower Customization dan Multi-Lane Battles"
      },
      {
        "type": "paragraph",
        "text": "Supercell menghadirkan update revolutionary untuk Clash Royale dengan Arena Evolution system yang memungkinkan customization towers, introduction multi-lane battle system, dan card evolution mechanics yang mengubah fundamental gameplay strategy."
      },
      {
        "type": "heading3",
        "text": "Tower Customization System"
      },
      {
        "type": "paragraph",
        "text": "Players kini dapat customize towers mereka dengan different defensive capabilities, visual themes, dan special abilities yang activate dalam certain conditions."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/clash-royale.jpg",
        "caption": "Various tower customization options dan upgrade paths"
      },
      {
        "type": "list",
        "text": [
          "5 Tower types: Cannon, Archer, Wizard, Tesla, Inferno",
          "Visual themes: Medieval, Futuristic, Nature, Dark Magic, Royal",
          "Special abilities: Activate ketika tower health turun dibawah 50%",
          "Upgrade paths: 3 different specializations per tower type",
          "Defensive auras: Passive effects untuk nearby friendly units"
        ]
      },
      {
        "type": "heading3",
        "text": "Multi-Lane Battle System"
      },
      {
        "type": "paragraph",
        "text": "Introduction 3-lane battle system yang mengubah strategy dari linear push menjadi multi-dimensional warfare. Players harus manage resources across multiple fronts simultaneously."
      },
      {
        "type": "list",
        "text": [
          "3 attack lanes: Left, Center, Right dengan different strategic values",
          "Lane advantages: Center lane memberikan crown tower bonus damage",
          "Cross-lane interactions: Certain cards dapat affect multiple lanes",
          "Resource management: Elixir allocation strategy becomes crucial",
          "Lane control: Dominance di certain lanes memberikan strategic bonuses"
        ]
      },
      {
        "type": "heading3",
        "text": "Card Evolution Mechanics"
      },
      {
        "type": "paragraph",
        "text": "Cards kini dapat berevolusi beyond max level dengan Evolution Stones yang earned melalui special challenges dan tournaments. Evolved cards mendapat new abilities dan visual upgrades."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/clash-royale.jpg",
        "caption": "Before/after comparison evolved cards"
      },
      {
        "type": "list",
        "text": [
          "Evolution requirements: Max level card + Evolution Stones + Gold",
          "New abilities: Evolved cards gain secondary effects",
          "Visual upgrades: Enhanced animations dan particle effects",
          "Star levels: Additional progression beyond evolution",
          "Collection book: Track evolution progress untuk all cards"
        ]
      },
      {
        "type": "heading3",
        "text": "Featured Card Evolutions"
      },
      {
        "type": "paragraph",
        "text": "Beberapa cards mendapat spotlight dengan evolution yang dramatically change their role dalam gameplay meta."
      },
      {
        "type": "list",
        "text": [
          "Evolved Wizard: Lightning chain attack yang jumps antara enemies",
          "Evolved Dragon: Splits into 3 smaller dragons ketika destroyed",
          "Evolved Giant: Leaves damaging rubble ketika dies",
          "Evolved Witch: Spawns skeleton army instead of individual skeletons",
          "Evolved Balloon: Creates freeze area ketika explodes"
        ]
      },
      {
        "type": "heading3",
        "text": "New Arena Environments"
      },
      {
        "type": "paragraph",
        "text": "6 arena environments baru dengan interactive elements yang mempengaruhi gameplay. Setiap arena memiliki unique mechanics yang harus dipertimbangkan dalam strategy."
      },
      {
        "type": "image",
        "url": "/assets/images/list-game/clash-royale.jpg",
        "caption": "Preview 6 arena environments dengan interactive elements"
      },
      {
        "type": "list",
        "text": [
          "Frozen Peaks: Ice patches yang slow down units",
          "Volcanic Valley: Lava streams yang damage ground units",
          "Mystic Forest: Healing springs yang restore unit health",
          "Cyber City: Speed boosts pads untuk increased unit movement",
          "Underwater Ruins: Water zones yang affect flying units differently",
          "Sky Temple: Floating platforms dengan jump mechanics"
        ]
      },
      {
        "type": "heading3",
        "text": "Clan Wars Revolution"
      },
      {
        "type": "paragraph",
        "text": "Complete overhaul dari Clan Wars dengan introduction territory control system, seasonal campaigns, dan collaborative clan building projects."
      },
      {
        "type": "list",
        "text": [
          "Territory map: 50 regions untuk control dengan different rewards",
          "Seasonal campaigns: 3-month storylines dengan progressive objectives",
          "Clan buildings: Collaborative projects yang provide clan-wide bonuses",
          "War modes: Classic, Evolution, Multi-lane battles dalam clan wars",
          "Alliance system: Multiple clans dapat form alliances untuk major wars"
        ]
      },
      {
        "type": "heading3",
        "text": "Championship Series 2025"
      },
      {
        "type": "paragraph",
        "text": "Professional competitive scene expansion dengan regional leagues, seasonal tournaments, dan $10 million prize pool untuk Clash Royale World Championship 2025."
      },
      {
        "type": "list",
        "text": [
          "Regional leagues: 12 regions dengan weekly matches",
          "Seasonal tournaments: Monthly competitions dengan evolving meta",
          "Draft mode: Professional format dengan card banning phase",
          "Team competitions: 3v3 clan-based tournaments",
          "Creator program: Content creator tournaments dengan audience participation"
        ]
      },
      {
        "type": "heading3",
        "text": "Quality of Life Improvements"
      },
      {
        "type": "paragraph",
        "text": "Massive improvements untuk user experience termasuk deck builder enhancements, replay system overhaul, dan social features expansion."
      },
      {
        "type": "list",
        "text": [
          "Smart deck builder: AI suggestions based on current meta",
          "Advanced replay system: 3D camera angles dan slow motion analysis",
          "Social hub: In-game meeting space untuk clan members",
          "Training ground: Practice dengan AI opponents of varying difficulties",
          "Statistics tracking: Detailed performance analytics untuk improvement"
        ]
      }
    ]
  }
]
